{
  "resourceType": "ValueSet",
  "id": "substance",
  "meta": {
    "lastUpdated": "2016-05-25T16:59:08.025+10:00"
  },
  "text": {
    "status": "generated"
  },
  "url": "http://fhir.org/guides/argonaut/ValueSet/substance",
  "version": "1.6.0",
  "name": "Argonaut Substance-Reactant for Intolerance and Negation Codes",
  "status": "draft",
  "experimental": true,
  "publisher": "Argonaut Project",
  "contact": [
    {
      "telecom": [
        {
          "system": "other",
          "value": "http://argonautwiki.hl7.org",
          "rank": 0
        }
      ]
    }
  ],
  "date": "2016-10-18T00:00:00+11:00",
  "description": "A substance or other type of agent (e.g., sunshine) that may be associated with an intolerance reaction event or a propensity to such an event. These concepts are expected to be at a more general level of abstraction (ingredients versus more specific formulations). This value set is quite general and includes concepts that may never cause an adverse event, particularly the included SNOMED CT concepts. The code system-specific value sets in this grouping value set are intended to provide broad coverage of all kinds of agents, but the expectation for use is that the chosen concept identifier for a substance should be appropriately specific and drawn from the available code systems in the following priority order: NDFRT, then RXNORM, then SNOMED CT. This overarching grouping value set is intended to support identification of drug classes, individual medication ingredients, foods, general substances and environmental entities",
  "immutable": false,
  "copyright": "This value set includes content from SNOMED CT, which is copyright © 2002+ International Health Terminology Standards Development Organisation (IHTSDO), and distributed by agreement between IHTSDO and HL7. Implementer use of SNOMED CT is not covered by this agreement",
  "extensible": false,
  "compose": {
    "import": [
      "http://fhir.org/guides/argonaut/ValueSet/substance-ndfrt",
      "http://fhir.org/guides/argonaut/ValueSet/substance-rxnorm",
      "http://fhir.org/guides/argonaut/ValueSet/substance-sct"
    ],
    "include": [
      null,
      null,
      null,
      {
        "system": "http://snomed.info/sct",
        "concept": [
          {
            "code": "160244002",
            "display": "No Known Allergies"
          },
          {
            "code": "429625007",
            "display": "No Known Food Allergies"
          },
          {
            "code": "409137002",
            "display": "No Known Drug Allergies"
          },
          {
            "code": "428607008",
            "display": "No Known Environmental Allergy"
          }
        ]
      }
    ]
  }
}